---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsDuplicateShapePresent
source: html/f7f61202-829e-00fd-2541-65e86872237c.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsDuplicateShapePresent Property

Whether the shape definition includes an offset
 copy of the 2D shape.

## Syntax (C#)
```csharp
public bool IsDuplicateShapePresent { get; }
```